Catalogs/КР_ДополнительныеНастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КР_ДополнительныеНастройкиСистемы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеВХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеВХранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КР_ДополнительныеНастройкиСистемы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МенеджерОбъекта = Справочники.КР_ДополнительныеНастройкиСистемы;
	
	СтруктураНастройки = МенеджерОбъекта.ПолучитьОграничениеПолейФормыПредопределенногоЭлемента(
		Объект.ИмяПредопределенныхДанных);
	Если СтруктураНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	// << 28.12.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-970
	Элементы.Значение.Видимость = СтруктураНастройки.ДоступноЗначение
		И ДоступенВыбор(СтруктураНастройки, "Значение");
	Элементы.СписокЗначений.Видимость = СтруктураНастройки.ДоступенСписокЗначений
		И ДоступенВыбор(СтруктураНастройки, "СписокЗначений");
	// >> 28.12.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-970
	
	Если СтруктураНастройки.ДоступноЗначение Тогда 
		СтруктураСвойствЗначения = СтруктураНастройки.СтруктураСвойствЗначения; 
		Для Каждого КлючИЗначение Из СтруктураСвойствЗначения Цикл
			Если КлючИЗначение.Значение <> Неопределено Тогда
				Элементы.Значение[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СтруктураНастройки.ДоступенСписокЗначений Тогда 
		СтруктураСвойствСписка = СтруктураНастройки.СтруктураСвойствСписка; 
		Для Каждого КлючИЗначение Из СтруктураСвойствСписка Цикл
			Если КлючИЗначение.Значение <> Неопределено Тогда
				Элементы.СписокЗначенийЗначение[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

// << 13.01.2023 Маскаев П.Ю., КРОК, JIRA№ A2105505-970
&НаСервереБезКонтекста
Функция ДоступенВыбор(СтруктураНастройки, ИсточникВыбора = "Значение")
	
	ФлагДоступенВыбор = Ложь;
	МДСправочника = Метаданные.Справочники.КР_ДополнительныеНастройкиСистемы;
	
	Если ИсточникВыбора = "Значение" Тогда
		СтруктураСвойств = СтруктураНастройки.СтруктураСвойствЗначения;
		РазрешенныеТипы = МДСправочника.Реквизиты.Значение.Тип;
	ИначеЕсли ИсточникВыбора = "СписокЗначений" Тогда
		СтруктураСвойств = СтруктураНастройки.СтруктураСвойствСписка;
		РазрешенныеТипы = МДСправочника.ТабличныеЧасти.СписокЗначений.Реквизиты.Значение.Тип;
	Иначе
		Возврат ФлагДоступенВыбор;
	КонецЕсли;
	
	Если СтруктураСвойств = Неопределено Тогда
		ФлагДоступенВыбор = Истина;
	Иначе
		ТипыОграничения = СтруктураСвойств.ОграничениеТипа.Типы();
		Для Каждого ТипОграничения Из ТипыОграничения Цикл
			Если РазрешенныеТипы.СодержитТип(ТипОграничения) Тогда
				ФлагДоступенВыбор = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ФлагДоступенВыбор;
	
КонецФункции // >> 13.01.2023 Маскаев П.Ю., КРОК, JIRA№ A2105505-970

#КонецОбласти
